# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 1
max_length = 0
for fruit in fruits:
    if len(fruit) > max_length:
        max_length = len(fruit)
for fruit in fruits:
    fruit = (max_length - len(fruit) + 1) * " " + fruit
    print(f"{i}.{fruit}")
    i += 1
    

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

list_1 = ["a", "b", "c", "d", "e"]
list_2 = ["c", "d", "e", "f", "g"]
i = 0
while i < len(list_1):
    for k in list_2:
        if list_1[i] == k:
            list_1.pop(i)
            i -= 1
    i += 1
print(list_1)

# Решение с помощью множеств:

list_1 = {"a", "b", "c", "d", "e"}
list_2 = {"c", "d", "e", "f", "g"}
print(list_1 - list_2)




# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.      

list_3 = [13, 15, 16 ,9, 0, 20, 100, 2]
list_4 = []
for i in list_3:
    if i % 2 == 0:
        add = i / 4
    else:
        add = i * 2
    list_4.append(add)
print(list_4)
